{
  "architectures": [
    "PhiForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 50256,
  "dtype": "float32",
  "embd_pdrop": 0.0,
  "eos_token_id": 50256,
  "freeze_mm_mlp_adapter": false,
  "hidden_act": "gelu_new",
  "hidden_size": 2048,
  "image_aspect_ratio": null,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "mm_hidden_size": 1024,
  "mm_projector_lr": null,
  "mm_projector_type": "mlp2x_gelu",
  "mm_resampler_type": null,
  "mm_vision_select_feature": "patch",
  "mm_vision_select_layer": -1,
  "mm_vision_tower": "mixedencoder",
  "continuous_training": true,
  "vision_tower_dino": "/mnt/facebook/dinov3-convnext-large-pretrain-lvd1689m",
  "vision_tower_siglip": "/mnt/siglip-so400m-patch14-384",
  "model_type": "bunny-phi",
  "num_attention_heads": 32,
  "num_hidden_layers": 24,
  "num_key_value_heads": 32,
  "pad_token_id": 50256,
  "partial_rotary_factor": 0.5,
  "qk_layernorm": false,
  "resid_pdrop": 0.0,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 2048,
  "tokenizer_padding_side": "right",
  "transformers_version": "4.57.1",
  "tune_mm_mlp_adapter": true,
  "unfreeze_vision_tower": true,
  "use_cache": true,
  "use_mm_proj": true,
  "use_s2": false,
  "vocab_size": 51200
}
